ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_CDC.c
/**
  ******************************************************************************
  * @file    MDR1986VK01_usb_CDC.c
  * @author  Milandr Application Team
  * @version V1.1.0
  * @date    07/04/2022
  * @brief   USB Communication Device Class source file.
  ******************************************************************************
  * <br><br>
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, MILANDR SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2022 Milandr</center></h2>
  */

/* Includes ------------------------------------------------------------------*/
#include "MDR1986VK01_config.h"
#include "MDR1986VK01_usb_handlers.h"
#include <stdio.h>

#define ASSERT_INFO_FILE_ID    FILEID__MDR1986VK01_USB_CDC_C

/** @addtogroup __MDR1986VK01_StdPeriph_Driver MDR1986VK01 Standard Peripherial Driver
 * @{
 */

/** @addtogroup USB_DEVICE_AND_CDC USB DEVICE AND CDC
 * @{
 */

/** @defgroup USB_CDC USB Communication Device Class
 * @{
 */

/** @defgroup USB_CDC_Private_Types USB CDC Private Types
 * @{
 */

/**
 * @brief CDC internal context type
 */

typedef struct
{
    uint8_t*            CDC_ReceiveBuffer;
    uint32_t            CDC_DataPortionLength;
    volatile USB_Result CDC_SendDataStatus,
                        CDC_ReceiveDataStatus;
}USB_CDCContext_TypeDef;


/** @} */ /* End of group USB_CDC_Private_Types */

/** @defgroup USB_CDC_Private_Constants USB CDC Private Constants
 * @{
 */

#ifdef USB_REMOTE_WAKEUP_SUPPORTED
#define USB_REMOTE_WAKEUP      0x20
#else
#define USB_REMOTE_WAKEUP      0
#endif                                                                                                         /* USB_REMOTE_WAKEUP_SUPPORTED */
#ifdef USB_SELF_POWERED_SUPPORTED
#define USB_SELF_POWERED       0x40
#else
#define USB_SELF_POWERED       0
#endif                                                                                                         /* USB_SELF_POWERED_SUPPORTED */
#define USB_POWER_ATTIBUTES    0x80 | USB_REMOTE_WAKEUP | USB_SELF_POWERED

/** @} */ /* End of group USB_CDC_Private_Constants */

/** @defgroup USB_CDC_Private_Variables USB CDC Private Variables
 * @{
 */

/**
 * @brief CDC internal context
 */

static USB_CDCContext_TypeDef USB_CDCContext;

/**
 * @brief Standard Device Descriptor
 */


static uint8_t Usb_CDC_Device_Descriptor[ 0x12 ] =
{
    0x12,                                                                                                      /* bLength                  */
    0x01,                                                                                                      /* bDescriptorType (Device) */
    0x10, 0x01,                                                                                                /* bcdUSB                   */
    0x02,                                                                                                      /* bDeviceClass (CDC)       */
    0x00,                                                                                                      /* bDeviceSubClass          */
    0x00,                                                                                                      /* bDeviceProtocol          */
    MAX_PACKET_SIZE,                                                                                           /* bMaxPacketSize0          */
    0x83, 0x04,                                                                                                /* idVendor                 */
    0x25, 0xF1,                                                                                                /* idProduct                */
    0x00, 0x00,                                                                                                /* bcdDevice                */
    0x00,                                                                                                      /* iManufacturer            */
    0x00,                                                                                                      /* iProduct                 */
    0x00,                                                                                                      /* iSerialNumber            */
    0x01                                                                                                       /* bNumConfigurations       */
};

/**
 * @brief Standard Configuration Descriptor
 */

#define USB_CDC_CONFIG_DESCR_LENGTH    0x43

static uint8_t Usb_CDC_Configuration_Descriptor[ 0x43 ] =
{
    /* Configuration Descriptor */
    0x09,                                                                                                      /* bLength                         */
    0x02,                                                                                                      /* bDescriptorType (Configuration) */
    0x43, 0x00,                                                                                                /* wTotalLength                    */
    0x02,                                                                                                      /* bNumInterfaces                  */
    0x01,                                                                                                      /* bConfigurationValue             */
    0x00,                                                                                                      /* iConfiguration                  */
    USB_POWER_ATTIBUTES,                                                                                       /* bmAttributes                    */
    0x32,                                                                                                      /* bMaxPower (100 mA)              */

