ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_CDC.c
    /* Interface Descriptor */
    0x09,                                                                                                      /* bLength                                         */
    0x04,                                                                                                      /* bDescriptorType (Interface)                     */
    0x00,                                                                                                      /* bInterfaceNumber                                */
    0x00,                                                                                                      /* bAlternateSetting                               */
    0x01,                                                                                                      /* bNumEndpoints                                   */
    0x02,                                                                                                      /* bInterfaceClass (Communication Interface Class) */
    0x02,                                                                                                      /* bInterfaceSubClass (Abstract Control Model)     */
    0x01,                                                                                                      /* bInterfaceProtocol (Common AT commands)         */
    0x00,                                                                                                      /* iInterface                                      */
    /* Header Functional Descriptor */
    0x05,                                                                                                      /* bLength (Endpoint Descriptor size)        */
    0x24,                                                                                                      /* bDescriptorType (CS_INTERFACE)            */
    0x00,                                                                                                      /* bDescriptorSubtype (Header Func Desc)     */
    0x10, 0x01,                                                                                                /* bcdCDC (Release Number)                   */
    /* Call Managment Functional Descriptor */
    0x05,                                                                                                      /* bFunctionLength                           */
    0x24,                                                                                                      /* bDescriptorType (CS_INTERFACE)            */
    0x01,                                                                                                      /* bDescriptorSubtype (Call Management)      */
    0x00,                                                                                                      /* bmCapabilities:                           */
    0x01,                                                                                                      /* bDataInterface                            */
    /* ACM Functional Descriptor */
    0x04,                                                                                                      /* bFunctionLength                           */
    0x24,                                                                                                      /* bDescriptorType (CS_INTERFACE)            */
    0x02,                                                                                                      /* bDescriptorSubtype (Abstract Control Management)*/
    0x06,                                                                                                      /* bmCapabilities                            */
    /* Union Functional Descriptor */
    0x05,                                                                                                      /* bFunctionLength                           */
    0x24,                                                                                                      /* bDescriptorType (CS_INTERFACE)            */
    0x06,                                                                                                      /* bDescriptorSubtype (Union func desc)      */
    0x00,                                                                                                      /* bMasterInterface (Communication class interface) */
    0x01,                                                                                                      /* bSlaveInterface0 (Data Class Interface)   */
    /* Endpoint 2 Descriptor */
    0x07,                                                                                                      /* bLength (Endpoint Descriptor size)        */
    0x05,                                                                                                      /* bDescriptorType (Endpoint)                */
    0x82,                                                                                                      /* bEndpointAddress (IN | 2)                 */
    0x03,                                                                                                      /* bmAttributes (Interrupt)                  */
    MAX_PACKET_SIZE, 0x00,                                                                                     /* wMaxPacketSize                 */
    0x02,                                                                                                      /* bInterval                                 */
    /* Data class interface Descriptor */
    0x09,                                                                                                      /* bLength (Endpoint Descriptor size)        */
    0x04,                                                                                                      /* bDescriptorType (Interface)               */
    0x01,                                                                                                      /* bInterfaceNumber                          */
    0x00,                                                                                                      /* bAlternateSetting                         */
    0x02,                                                                                                      /* bNumEndpoints (Two endpoints used)        */
    0x0A,                                                                                                      /* bInterfaceClass (CDC)                     */
    0x00,                                                                                                      /* bInterfaceSubClass                        */
    0x00,                                                                                                      /* bInterfaceProtocol                        */
    0x00,                                                                                                      /* iInterface                                */
    /* Endpoint 1 Descriptor */
    0x07,                                                                                                      /* bLength (Endpoint Descriptor size)        */
    0x05,                                                                                                      /* bDescriptorType (Endpoint)                */
    0x81,                                                                                                      /* bEndpointAddress (IN | 1)                 */
    0x02,                                                                                                      /* bmAttributes (Bulk)                       */
    MAX_PACKET_SIZE, 0x00,                                                                                     /* wMaxPacketSize                 */
    0x00,                                                                                                      /* bInterval                                 */
    /* Endpoint 3 Descriptor */
    0x07,                                                                                                      /* bLength (Endpoint Descriptor size)        */
    0x05,                                                                                                      /* bDescriptorType (Endpoint)                */
    0x03,                                                                                                      /* bEndpointAddress (OUT | 3)                */
    0x02,                                                                                                      /* bmAttributes (Bulk)                       */
    MAX_PACKET_SIZE, 0x00,                                                                                     /* wMaxPacketSize                 */
    0x00,                                                                                                      /* bInterval                                 */
};

#if ( defined( USB_CDC_LINE_CODING_SUPPORTED ) || defined( USB_CDC_COMM_FEATURE_SUPPORTED ) )
/**
 * @brief Buffer for Line Coding and Communication Feature data stage
 */
static union
{
#ifdef USB_CDC_LINE_CODING_SUPPORTED
    USB_CDC_LineCoding_TypeDef LineCoding;
#endif                                                                                                         /* USB_CDC_LINE_CODING_SUPPORTED */
#ifdef USB_CDC_COMM_FEATURE_SUPPORTED
    uint16_t                   CommFeature;
#endif                                                                                                         /* USB_CDC_COMM_FEATURE_SUPPORTED */
} CDC_ClassPacketData;
#endif                                                                                                         /* USB_CDC_LINE_CODING_SUPPORTED || USB_CDC_COMM_FEATURE_SUPPORTED */

#ifdef USB_CDC_STATE_REPORTING_SUPPORTED
/**
 * @brief Buffer Line State Report package
 */
static struct
{
    USB_SetupPacket_TypeDef SetupPacket;
    uint16_t                LineState;
} CDC_StateReportPacket =
{
    {
        ( USB_DEVICE_TO_HOST | USB_TYPE_CLASS | USB_RECIPIENT_INTERFACE ),                                     /* mRequestTypeData */
        USB_CDC_SERIAL_STATE,                                                                                  /* bRequest */
        0,                                                                                                     /* wValue */
        1,                                                                                                     /* wIndex */
        2                                                                                                      /* wLength */
    },
    0                                                                                                          /* LineState */
};
#endif                                                                                                         /* USB_CDC_STATE_REPORTING_SUPPORTED */

/** @} */ /* End of group USB_CDC_Private_Variables */

