ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Examples/MDR1986VK01/usb_cdc_echo/MDR1986VK01_usb_CDC.c
/** @defgroup USB_CDC_Private_Macros USB CDC Private Macros
 * @{
 */

/** @} */ /* End of group USB_CDC_Private_Macros */

/** @defgroup USB_CDC_Private_FunctionPrototypes USB CDC Private Function Prototypes
 * @{
 */

static USB_Result USB_CDC_OnDataSent( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length );
static USB_Result USB_CDC_OnDataReceive( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length );
static USB_Result USB_CDC_DoDataOut( USB_EP_TypeDef EPx, uint8_t* Buffer, uint32_t Length );

/** @} */ /* End of group USB_CDC_Private_FunctionPrototypes */

/** @defgroup USB_CDC_Private_Functions USB CDC Private Functions
 * @{
 */


/**
 * @brief  Initializes CDC context.
 *
 * @param  ReceiveBuffer: Pointer to memory buffer to place incoming
 *         data to. The buffer length should be equal or greater
 *         then MAX_PACKET_LENGTH and DataPortionLength.
 *
 * @param  DataPortionLength: Amount of data received that triggers
 *         USB_CDC_HANDLE_DATA_RECEIVE handler to be called. If any
 *         data should be immediately handled, this parameter should
 *         be set to 1.
 *
 * @param  DataPortionLength: Amount of data received that triggers
 *         USB_CDC_HANDLE_DATA_RECEIVE handler to be called. If any
 *         data should be immediately handled, this parameter should
 *         be set to 1.
 *
 * @param  StartReceiving: Flag indicating whether the device will accept
 *         incoming data immediately after USB_CDC_Reset is called for the
 *         first time.
 *
 * @retval USB_Result.
 */

USB_Result USB_CDC_Init( uint8_t* ReceiveBuffer, uint32_t DataPortionLength, FlagStatus StartReceiving )
{
    USB_CDC_SetReceiveBuffer( ReceiveBuffer, DataPortionLength );
    USB_CDCContext.CDC_SendDataStatus    = USB_SUCCESS;
    USB_CDCContext.CDC_ReceiveDataStatus = StartReceiving ? USB_SUCCESS : USB_ERR_BUSY;

    return USB_SUCCESS;
}


/**
 * @brief  Sets the (new) buffer for incoming data.
 *
 * @param  ReceiveBuffer: Pointer to memory buffer to place incoming
 *         data to. The buffer length should be equal or greater
 *         then MAX_PACKET_LENGTH and DataPortionLength.
 *
 * @param  DataPortionLength: Amount of data received that triggers
 *         USB_CDC_HANDLE_DATA_RECEIVE handler to be called. If any
 *         data should be immediately handled, this parameter should
 *         be set to 1.
 *
 * @retval USB_Result.
 */

USB_Result USB_CDC_SetReceiveBuffer( uint8_t* ReceiveBuffer, uint32_t DataPortionLength )
{
    /* Check the parameters */
    assert_param( ReceiveBuffer );

    USB_CDCContext.CDC_ReceiveBuffer     = ReceiveBuffer;
    USB_CDCContext.CDC_DataPortionLength = DataPortionLength;

    return USB_SUCCESS;
}

/**
 * @brief  Starts (or restarts) incoming data receiving.
 *
 * @retval USB_Result.
 *
 */

USB_Result USB_CDC_ReceiveStart( void )
{
    USB_CDCContext.CDC_ReceiveDataStatus = USB_SUCCESS;
    return USB_EP_doDataOut( USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
                             USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive );
}

/**
 * @brief  Stops (suspends) incoming data receiving.
 *
 * @retval USB_Result.
 *
 */

USB_Result USB_CDC_ReceiveStop( void )
{
    USB_CDCContext.CDC_ReceiveDataStatus = USB_ERR_BUSY;
    return USB_EP_Stall( USB_CDC_EP_RECEIVE, USB_STALL_PROTO );
}

/**
 * @brief  Initiates sending of data portion to the host
 *
 * @param  Buffer: Pointer to the user's buffer containing data
 *         to be sent
 *
 * @param  Length: Length of data
 *
 * @retval USB_Result.
 *
 * @note   The function returns immediately.
 */

USB_Result USB_CDC_SendData( uint8_t* Buffer, uint32_t Length )
{
    /* Check if previous data sending is complete */
    USB_Result result = USB_CDCContext.CDC_SendDataStatus;

    /* If data can be sent, set "busy" flag and initiate data portion transfer */
    if ( result == USB_SUCCESS )
    {
        USB_CDCContext.CDC_SendDataStatus = USB_ERR_BUSY;
        result                            =
            USB_EP_doDataIn( USB_CDC_EP_SEND, Buffer, Length, USB_CDC_OnDataSent );
    }
    return result;
}

#ifdef USB_CDC_STATE_REPORTING_SUPPORTED
/**
 * @brief  Sends special Line State Report to host
 *
 * @param  LineState: Coded line state.
 *         This parameter can be any combination of the following values:
 *           @arg USB_CDC_bRxCarrier
 *           @arg USB_CDC_bTxCarrier
 *           @arg USB_CDC_bBreak
 *           @arg USB_CDC_bRingSignal
 *           @arg USB_CDC_bFraming
 *           @arg USB_CDC_bParity
 *           @arg USB_CDC_bOverRun
 *
 * @retval USB_Result.
 *
 * @note   The function returns immediately.
 */

USB_Result USB_CDC_ReportState( uint16_t LineState )
{
    CDC_StateReportPacket.LineState = LineState;
    return USB_EP_doDataIn( USB_CDC_EP_STATE, ( uint8_t* )&CDC_StateReportPacket,
                            sizeof( CDC_StateReportPacket ), NULL );
}
#endif                                                                                                         /* USB_CDC_STATE_REPORTING_SUPPORTED */

/** @defgroup USB_CDC_Private_Overwritten_Device_Handlers USB CDC Overwritten Device Handlers implementation
 * @{
 */

/**
 * @brief  Initial CDC setup/reset
 *
 * @param  None
 *
 * @retval USB_Result.
 */

USB_Result USB_CDC_Reset( void )
{
    USB_Result result;
    UsbEPCfg_t epCfg;

    /* Inherited handler call */
    result = USB_DeviceReset();

    if ( result == USB_SUCCESS )
    {
        /* EP1, EP2 and EP3 initialization */
        epCfg.DataPtr         = NULL;
        epCfg.EP_Num          = USB_CDC_EP_SEND;
        epCfg.EP_Type         = Bulk;
        epCfg.Direction       = Tx;
        epCfg.AutoHandling    = 0;
        epCfg.PktMaxSize      = MAX_PACKET_SIZE;
        epCfg.DoubleBuffering = 0;
        USB_InitEP( &epCfg );
        USB_EP_Init( USB_CDC_EP_SEND, USB_CDC_HANDLE_SEND_ERROR );

        epCfg.EP_Num    = USB_CDC_EP_STATE;
        epCfg.EP_Type   = Irq;
        epCfg.Direction = Tx;
        USB_InitEP( &epCfg );
        USB_EP_Init( USB_CDC_EP_STATE, USB_CDC_HANDLE_LINE_STATE_REPORT_SEND_ERROR );

        epCfg.EP_Num    = USB_CDC_EP_RECEIVE;
        epCfg.EP_Type   = Bulk;
        epCfg.Direction = Rx;
        USB_InitEP( &epCfg );
        USB_EP_Init( USB_CDC_EP_RECEIVE, 0 );

        /* Start to listen for incoming data, if desired */
        if ( USB_CDCContext.CDC_ReceiveDataStatus == USB_SUCCESS )
        {
            result = USB_EP_doDataOut( USB_CDC_EP_RECEIVE, USB_CDCContext.CDC_ReceiveBuffer,
                                       USB_CDCContext.CDC_DataPortionLength, USB_CDC_OnDataReceive );
        }
    }
    return result;
}

/**
 * @brief  GET_DESCRIPTOR standard request handler implementation for CDC.
 *
 * @param  wVALUE: Descriptor Type and Descriptor Index
 *
 * @param  wINDEX: Not used
 *
 * @param  wLENGTH: Amount of data host is willing to receive.
 *
 * @retval USB_Result.
 *
 * @note   This handler transmits to host an appropriate CDC descriptor data.
 */

USB_Result USB_CDC_GetDescriptor( uint16_t wVALUE, uint16_t wINDEX, uint16_t wLENGTH )
{
    uint8_t*   pDescr = 0;
    uint32_t   length;
    USB_Result result = USB_SUCCESS;

    /* Only 0 configuration is supported; for device request this field must be 0 */
    if ( ( wVALUE & 0xFF ) != 0 )
    {
        result = USB_ERROR;
    }
    else
    {
        switch ( wVALUE >> 8 )                                                                                 /* Descriptor type */
        {
        case USB_DEVICE:
            pDescr = Usb_CDC_Device_Descriptor;
            length = 0x12;
            break;
        case USB_CONFIGURATION:
            pDescr = Usb_CDC_Configuration_Descriptor;
            length = 0x43;
            break;
        default:
            result = USB_ERROR;
        }
    }

